# Restore on the new machine with `brew bundle --file=Brewfile`

tap "caskformula/caskformula"
tap "ngrok/ngrok"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Isolated development environments using Docker
brew "docker-compose"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Node version management
brew "n"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# SMART hard drive monitoring
brew "smartmontools"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Sound and music editor
cask "ableton-live-suite"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Desktop password and login vault
cask "bitwarden"
# Web browser focusing on privacy
cask "brave-browser"
# Two-panel file manager
cask "commander-one"
# Write, edit, and chat about your code with AI
cask "cursor"
# Server and cloud storage browser
cask "cyberduck"
# BitTorrent client
cask "deluge"
# Disk usage utility
cask "disk-inventory-x"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Bitcoin thin client
cask "electrum"
# Web browser
cask "firefox"
# Horizontal and vertical rulers
cask "free-ruler"
# Utility to hide menu bar items
cask "hiddenbar"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Clipboard manager
cask "maccy"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Video communication and virtual meeting platform
cask "zoom"
vscode "10nates.ollama-autocoder"
vscode "ardonplay.jetbrains-idea-product-icon-theme"
vscode "astro-build.astro-vscode"
vscode "biomejs.biome"
vscode "chakrounanas.turbo-console-log"
vscode "commitollama.commitollama"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "eenaree.webstorm-new-dark"
vscode "iondesign.ion"
vscode "jebbs.plantuml"
vscode "k--kato.intellij-idea-keybindings"
vscode "mhutchie.git-graph"
vscode "zardoy.ts-essential-plugins"
cargo "tauri-cli"
uv "docling"
npm "@qwen-code/qwen-code"
npm "opencode-ai"
